/* eslint-disable consistent-return */
import React, { useState } from 'react'
import Head from 'next/head'
import { LiqPayPay } from 'react-liqpay'
import styles from '../styles/Home.module.css'
import Faq from '../components/FAQ/FAQ'
import FlowerTitleSection from '../components/FlowerTitleSection/FlowerTitleSection'
import Title from '../components/Title/Title'
import BoxData from '../components/BoxData/BoxData'
import PhotoFood from '../components/PhotoFood/PhotoFood'
import Table from '../components/Table/Table'

const Home = () => {
  const [questionIsOpen, questionIsOpenHandler] = useState(null)
  const [navIsOpen, navIsOpenHandler] = useState(false)
  const [getResult, getResultHandler] = useState(null)
  const [getMenu, getMenuHandler] = useState(null)
  const [typeMenu, typeMenuHandler] = useState(null)
  const [choosedMenu, choosedMenuHandler] = useState(null)

  const FAQestions = [
    {
      id: '0',
      question: 'Раціон підійде будь-кому?',
      answer: 'Збалансоване раціональне харчування полягає у підтриманні необхідної кількості мікроелементів і вітамінів, які організм не може синтезувати, тому вони повинні надходити разом з їжею. Таке харчування іноді прирівнюють до дієт, однак не всяке збалансоване меню сприяє схудненню.'
    },
    {
      id: '1',
      question: 'Як позбавитися жиру на животі ???',
      answer: 'Жир не можливо спалювати в окремих частинах тіла, а лише комплексно. Тому, правильне і збалансоване харчування, з урахуванням потрібної вам калорійності, в поєднанні з систематичним фізичним навантаженням у вигляді кардіо та силових тренувань, є найкращим способом досягти бажаної форми, в тому числі і на животі.'
    },
    {
      id: '2',
      question: 'Яка дієта забезпечує найшвидше схуднення ???',
      answer: 'Є багато дієт які дають швидкий але не стійкий результат і , в основному, є великим стресом для організму. Короткострокові дієти призводять до різкої втрати ваги і в подальшому її відновленню і навіть дають зворотній ефект в небажану сторону. Тільки стабільне збалансоване і здорове харчування з врахуванням потрібної вам калорійність дасть бажаний довгостроковий і стабільний ефект не шкідливий для вашого здоров’я.'
    }
  ]
  const innerTitles = [
    'СХУДНУТИ БЕЗ ДІЄТ ТА ВЕЛИКИХ ЗУСИЛЬ',
    'НЕ ПОТРІБНО ВІДМОВЛЯТИСЬ ВІД УЛЮБЛЕНОЇ ЇЖІ',
    'СМАЧНО ТА ЗБАЛАНСОВАНО ХАРЧУВАТИСЬ',
    'ПОДІЛИТИСЬ ІЗ БЛИЗЬКИМИ, АДЖЕ РАЦІОН ПІДІЙДЕ ДЛЯ ВСІЄЇ СІМ’Ї'
  ]
  const checkPercent = (calories) => {
    if (calories > 1650) return calories
    if (calories > 1550 && calories < 1650) {
      return 1600
    }
    if (calories > 1450 && calories < 1550) {
      return 1500
    }
    if (calories > 1350 && calories < 1450) {
      return 1400
    }
    if (calories > 1250 && calories < 1350) {
      return 1300
    }
    if (calories > 1150 && calories < 1250) {
      return 1200
    }
  }
  const getTypeMenu = (arr) => {
    getMenuHandler(arr)
    const caloriesTemp = getResult.caloriesWithSport.value
    const calories = (caloriesTemp - ((caloriesTemp / 100) * 20))
    const result = checkPercent(caloriesTemp)
    if (arr === 1) {
      typeMenuHandler(checkPercent(calories)) // хочу схуднути
    }
    if (arr === 0) {
      typeMenuHandler(result) // підтримати вагу
    }
  }

  return (
    <div>
      <Head>
        <title>IRYNA SHEREMETA</title>
        <link rel="icon" href="/favicon.ico" />
      </Head>
      <header className={styles.header}>
        <div className={styles.leftPart}>
          <div className={styles.logoContainer}>
            <img src="./images/logo.jpg" alt="" />
            <h1>IRYNA SHEREMETA</h1>
          </div>
          <h1 className={styles.mainPhrase}>
            Хочете позбутися зайвої ваги і покращити здоров’я?
          </h1>
          <p>
            Отримайте хороший результат завдяки
            збалансованому плану харчування.
          </p>
          <a href="#nextScreen" className={styles.nextScreenContainer}>
            Дізнатись більше
            <svg width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M8.38336 15.4054C8.45217 15.5051 8.54423 15.5866 8.65163 15.6429C8.75903 15.6993 8.87853 15.7287 8.99986 15.7287C9.12119 15.7287 9.2407 15.6993 9.34809 15.6429C9.45549 15.5866 9.54756 15.5051 9.61636 15.4054L16.3664 5.67652C16.4445 5.5643 16.4903 5.43287 16.4988 5.2965C16.5074 5.16013 16.4783 5.02403 16.4147 4.90299C16.3512 4.78196 16.2556 4.68062 16.1384 4.60998C16.0212 4.53934 15.8868 4.50211 15.7499 4.50232H2.24986C2.11324 4.50288 1.97936 4.5406 1.86262 4.61141C1.74588 4.68221 1.65069 4.78344 1.58729 4.90419C1.52389 5.02495 1.49467 5.16066 1.50279 5.29674C1.51091 5.43282 1.55605 5.56412 1.63336 5.67652L8.38336 15.4054Z" fill="#545454" />
            </svg>
          </a>
        </div>
        <div className={styles.rightPart}>
          <div className={styles.imageContainer} />
          <nav className={navIsOpen ? `${styles.menu} ${styles.menuActive}` : styles.menu}>
            <ul>
              <li>
                <a onClick={() => navIsOpenHandler(false)} href="#pluses">
                  Переваги раціону
                </a>
              </li>
              <li>
                <a onClick={() => navIsOpenHandler(false)} href="#racion">
                  Обрати раціон
                </a>
              </li>
              <li>
                <a onClick={() => navIsOpenHandler(false)} href="#questions">
                  Питання та відповіді
                </a>
              </li>
            </ul>
          </nav>
          <aside>
            <div className={styles.hamburger} onClick={() => navIsOpenHandler(!navIsOpen)}>
              <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0 18C0 16.3431 1.34315 15 3 15H35V21H3C1.34315 21 0 19.6569 0 18Z" fill="#545454" />
                <path d="M40 15H47C48.6569 15 50 16.3431 50 18C50 19.6569 48.6569 21 47 21H40V15Z" fill="#545454" />
                <path d="M0 32C0 30.3431 1.34315 29 3 29H10V35H3C1.34315 35 0 33.6569 0 32Z" fill="#545454" />
                <path d="M15 29H47C48.6569 29 50 30.3431 50 32C50 33.6569 48.6569 35 47 35H15V29Z" fill="#545454" />
              </svg>
              <p>MENU</p>
            </div>
            <div className={styles.socialContainer}>
              <a href="https://www.instagram.com/p/CHawsfgpqh4/?igshid=fk0uhmuj17ss">
                <svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M29.9998 17.9824C23.3494 17.9824 17.9822 23.3496 17.9822 30C17.9822 36.6504 23.3494 42.0176 29.9998 42.0176C36.6502 42.0176 42.0174 36.6504 42.0174 30C42.0174 23.3496 36.6502 17.9824 29.9998 17.9824ZM29.9998 37.8106C25.699 37.8106 22.1892 34.3008 22.1892 30C22.1892 25.6992 25.699 22.1895 29.9998 22.1895C34.3006 22.1895 37.8103 25.6992 37.8103 30C37.8103 34.3008 34.3006 37.8106 29.9998 37.8106ZM42.5096 14.6895C40.9568 14.6895 39.7029 15.9434 39.7029 17.4961C39.7029 19.0488 40.9568 20.3027 42.5096 20.3027C44.0623 20.3027 45.3162 19.0547 45.3162 17.4961C45.3167 17.1274 45.2444 16.7622 45.1035 16.4215C44.9626 16.0808 44.7559 15.7712 44.4952 15.5105C44.2345 15.2498 43.9249 15.043 43.5842 14.9022C43.2434 14.7613 42.8783 14.689 42.5096 14.6895ZM53.4256 30C53.4256 26.7656 53.4549 23.5606 53.2732 20.332C53.0916 16.582 52.2361 13.2539 49.4939 10.5117C46.7459 7.76367 43.4236 6.91407 39.6736 6.73243C36.4392 6.55078 33.2342 6.58008 30.0056 6.58008C26.7713 6.58008 23.5662 6.55078 20.3377 6.73243C16.5877 6.91407 13.2596 7.76953 10.5174 10.5117C7.76932 13.2598 6.91971 16.582 6.73807 20.332C6.55643 23.5664 6.58573 26.7715 6.58573 30C6.58573 33.2285 6.55643 36.4395 6.73807 39.668C6.91971 43.418 7.77518 46.7461 10.5174 49.4883C13.2654 52.2363 16.5877 53.0859 20.3377 53.2676C23.5721 53.4492 26.7771 53.4199 30.0056 53.4199C33.24 53.4199 36.4451 53.4492 39.6736 53.2676C43.4236 53.0859 46.7517 52.2305 49.4939 49.4883C52.242 46.7402 53.0916 43.418 53.2732 39.668C53.4607 36.4395 53.4256 33.2344 53.4256 30ZM48.2693 43.8164C47.8416 44.8828 47.326 45.6797 46.4998 46.5C45.6736 47.3262 44.8826 47.8418 43.8162 48.2695C40.7342 49.4941 33.4158 49.2188 29.9998 49.2188C26.5838 49.2188 19.2596 49.4942 16.1775 48.2754C15.1111 47.8477 14.3142 47.332 13.4939 46.5059C12.6678 45.6797 12.1521 44.8887 11.7244 43.8223C10.5056 40.7344 10.781 33.416 10.781 30C10.781 26.584 10.5056 19.2598 11.7244 16.1777C12.1521 15.1113 12.6678 14.3145 13.4939 13.4941C14.3201 12.6738 15.1111 12.1523 16.1775 11.7246C19.2596 10.5059 26.5838 10.7813 29.9998 10.7813C33.4158 10.7813 40.74 10.5059 43.8221 11.7246C44.8885 12.1523 45.6853 12.668 46.5056 13.4941C47.3318 14.3203 47.8474 15.1113 48.2752 16.1777C49.4939 19.2598 49.2185 26.584 49.2185 30C49.2185 33.416 49.4939 40.7344 48.2693 43.8164Z" fill="#545454" />
                </svg>
              </a>
              <a href="https://www.facebook.com/iryna.sheremeta.98">
                <svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M47.9364 4.56189H12.062C7.93701 4.56189 4.56201 7.93689 4.56201 12.0619V47.94C4.56201 52.065 7.93701 55.44 12.062 55.44H47.9401C52.0651 55.44 55.4401 52.065 55.4401 47.94V12.0619C55.4364 7.93689 52.0651 4.56189 47.9364 4.56189ZM47.4545 31.7175H41.417V53.5613H32.3833V31.7175H27.8645V24.1875H32.3833V19.6688C32.3833 13.5263 34.9333 9.87189 42.1895 9.87189H48.2214V17.4H44.4489C41.6289 17.4 41.4414 18.4556 41.4414 20.4188L41.417 24.1875H48.2514L47.4526 31.7175H47.4545Z" fill="#545454" />
                </svg>
              </a>
            </div>
          </aside>
        </div>
      </header>
      <div id="nextScreen" />
      <Title text="Правильне харчування дозволить нам бути здоровими та красивими." />
      <PhotoFood />
      <div id="pluses" />
      <Title text="Після отримання раціону ти зможеш" />
      <div className={styles.titleContainer}>
        {
          innerTitles.map((title, key) => <FlowerTitleSection title={title} key={key} />)
        }
      </div>
      <div className={styles.aboutRacion}>
        <p>
          План харчування складає середземноморський раціон,
          який являється по суті збалансованим здоровим харчуванням.
          Він не є протипоказаний і не несе загрози для здоров’я.
          Меню збалансоване, складає всі необхідні для організму речовини,
          і тому не забороняється людям із захворюваннями,
          вагітним та годуючим.
        </p>
        {/* <button type="button">
          ОЗНАЙОМИТИСЬ
          ІЗ РАЦІОНОМ
        </button> */}
      </div>
      <div className={styles.giftContainer}>
        <svg width="200" height="200" viewBox="0 0 1024 1024" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M160 894C160 911.7 174.3 926 192 926H478V550H160V894ZM546 926H832C849.7 926 864 911.7 864 894V550H546V926ZM880 310H732.4C746 288.6 754 263.2 754 236C754 159.9 692.1 98 616 98C574.6 98 537.3 116.4 512 145.4C486.7 116.4 449.4 98 408 98C331.9 98 270 159.9 270 236C270 263.2 277.9 288.6 291.6 310H144C126.3 310 112 324.3 112 342V482H478V310H546V482H912V342C912 324.3 897.7 310 880 310ZM478 306H408C369.4 306 338 274.6 338 236C338 197.4 369.4 166 408 166C446.6 166 478 197.4 478 236V306ZM616 306H546V236C546 197.4 577.4 166 616 166C654.6 166 686 197.4 686 236C686 274.6 654.6 306 616 306Z" fill="rgba(236, 160, 72, .7)" />
        </svg>

        <div>
          <p>В подарунок Ви отримаєте</p>
          <p>гайд “Гормони щастя”</p>
        </div>
      </div>

      <div id="racion" />
      <Title text="Оберіть раціон який підходить саме Вам" />
      <BoxData getResultHandler={(value) => getResultHandler(value)} />
      <div id="result" />
      <Title text="ВАШІ РЕЗУЛЬТАТИ" isColor />
      {
        getResult
          ? (
            <>
              <Table
                index={getResult.IMT}
                weight={getResult.idealWeight}
                calories={getResult.calories}
                caloriesWithSport={getResult.caloriesWithSport}
              />

              <div className={styles.btnContainer}>
                <button
                  type="button"
                  onClick={() => getTypeMenu(0)}
                  style={{ backgroundColor: getMenu === 0 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                >
                  Хочу підтримувати вагу
                </button>
                <button
                  type="button"
                  onClick={() => getTypeMenu(1)}
                  style={{ backgroundColor: getMenu === 1 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                >
                  Хочу схуднути
                </button>

              </div>
              {
                typeMenu
                  ? <p className={styles.calNeed}>{`При вказаних вище параметрах Вам необхідно дотримуватись раціону в ${typeMenu} калорій`}</p>
                  : null
              }
              <div className={styles.btnContainer}>
                {
                  typeMenu
                    ? (
                      <>
                        <button
                          type="button"
                          onClick={() => choosedMenuHandler(1200)}
                          style={{ backgroundColor: choosedMenu === 1200 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                        >
                          1200
                        </button>
                        <button
                          type="button"
                          onClick={() => choosedMenuHandler(1300)}
                          style={{ backgroundColor: choosedMenu === 1300 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                        >
                          1300
                        </button>
                        <button
                          type="button"
                          onClick={() => choosedMenuHandler(1400)}
                          style={{ backgroundColor: choosedMenu === 1400 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                        >
                          1400
                        </button>
                        <button
                          type="button"
                          onClick={() => choosedMenuHandler(1500)}
                          style={{ backgroundColor: choosedMenu === 1500 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                        >
                          1500
                        </button>
                        <button
                          type="button"
                          onClick={() => choosedMenuHandler(1600)}
                          style={{ backgroundColor: choosedMenu === 1600 ? 'rgba(236, 160, 72, 0.7)' : 'transparent' }}
                        >
                          1600
                        </button>
                      </>
                    )
                    : null
                }

              </div>
              <div className={styles.btnContainer}>
                {
                  choosedMenu !== null
                    ? (
                      <Title text={`Ви обрали раціон із калорійністю ${choosedMenu}`} />
                    )
                    : null
                }
              </div>
              <div className={styles.btnContainer}>
                {
                  choosedMenu !== null
                    ? (
                      <LiqPayPay
                        publicKey="i58423322834"
                        privateKey="4D76uYo260l9k9vJfwLcRhxb4a2DL2QZ7mf8v5Tw"
                        amount="499"
                        description="Payment for product"
                        currency="UAH"
                        orderId={Math.floor(1 + Math.random() * 900000000)}
                        result_url={`https://foodcoachiryna.com.ua/recipe${choosedMenu}`}
                        server_url="https://www.liqpay.ua/checkout/i58423322834"
                        product_description="Online courses"
                        style={{ margin: '8px' }}
                        title="Оплатити"
                      />
                    )
                    : null
                }
              </div>

            </>
          )
          : null
      }
      <div id="questions" />
      <Title text="ВІДПОВІДІ НА МОЖЛИВІ ПИТАННЯ" />
      <div className={styles.FAQContainer}>
        {
          FAQestions.map((item, key) => (
            <Faq
              item={item}
              key={key}
              isOpen={key.toString() === questionIsOpen ? questionIsOpen : null}
              openHandler={(id) => questionIsOpenHandler(id)}
            />
          ))
        }
      </div>
      <footer className={styles.footer}> 
        <p>контактна інформація +380 96 241 54 85</p>
        <p>serjukl98@gmail.com</p>
        <div>
          <svg width="30" height="20" viewBox="0 0 30 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M1.2 0.580078C0.53739 0.580078 0 1.11732 0 1.78008V18.2201C0 18.8828 0.53766 19.4201 1.2 19.4201H28.8C29.4626 19.4201 30 18.8828 30 18.2201V1.78008C30 1.11735 29.4623 0.580078 28.8 0.580078H1.2ZM17.9175 6.19476C18.6476 6.19476 19.2328 6.35604 19.6059 6.50601L19.3509 8.11008L19.1822 8.02476C18.8346 7.87479 18.3881 7.73046 17.7722 7.74069C17.0349 7.74069 16.6941 8.06958 16.6941 8.37729C16.6898 8.724 17.0923 8.95266 17.7506 9.29508C18.8371 9.82338 19.3393 10.4639 19.3322 11.306C19.3176 12.8425 18.0325 13.8354 16.0528 13.8354C15.2082 13.8261 14.3945 13.6473 13.9547 13.4407L14.2191 11.7832L14.4619 11.9013C15.0804 12.1777 15.4809 12.2895 16.2347 12.2895C16.776 12.2895 17.3569 12.0628 17.3616 11.5666C17.3651 11.2426 17.1187 11.0116 16.3856 10.6488C15.6712 10.2947 14.7242 9.70152 14.7347 8.6379C14.7459 7.19907 16.0566 6.19476 17.9175 6.19476V6.19476ZM2.65311 6.43008H5.69343C6.10284 6.44556 6.43338 6.57738 6.5475 7.02165L7.20282 10.4041C7.20291 10.4044 7.2027 10.4057 7.20282 10.406L7.39968 11.4195L9.24561 6.43008H11.2425L8.27436 13.7332L6.27936 13.7351L4.69125 7.84194C5.63619 8.34255 6.44067 8.92176 6.90657 9.71883C6.78645 9.46662 6.62817 9.18192 6.42564 8.90133C6.18978 8.57457 5.68041 8.15268 5.4675 7.97319C4.7256 7.34778 3.71805 6.84267 2.62968 6.5754L2.65311 6.43008V6.43008ZM12.0366 6.43851H13.9894L12.7678 13.7304H10.815L12.0366 6.43851V6.43851ZM23.0662 6.43851H24.5456L26.0944 13.7304H24.3187C24.3187 13.7304 24.1426 12.8927 24.0853 12.6373C23.8062 12.6373 21.8543 12.6345 21.6347 12.6345C21.5604 12.8319 21.2316 13.7304 21.2316 13.7304H19.2225L22.0641 7.04415C22.2652 6.56901 22.6082 6.43851 23.0662 6.43851V6.43851ZM23.2116 8.39976C23.1155 8.67099 22.9482 9.10899 22.9594 9.08976C22.9594 9.08976 22.3582 10.693 22.201 11.1091L23.7806 11.1082C23.7045 10.7466 23.34 9.02232 23.34 9.02232L23.2116 8.39982V8.39976Z" fill="black" />
          </svg>
          <svg width="30" height="24" viewBox="0 0 30 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clipPath="url(#clip0)">
              <path d="M5.45367 23.2045V21.661C5.45367 21.0692 5.09344 20.6835 4.47598 20.6835C4.1673 20.6835 3.83285 20.7863 3.60129 21.1208C3.42129 20.8378 3.16406 20.6835 2.77816 20.6835C2.52082 20.6835 2.26371 20.7606 2.05781 21.0436V20.7349H1.51758V23.2045H2.05781V21.841C2.05781 21.4038 2.28937 21.1979 2.64961 21.1979C3.00961 21.1979 3.18984 21.4295 3.18984 21.841V23.2045H3.73008V21.841C3.73008 21.4038 3.98719 21.1979 4.32164 21.1979C4.68188 21.1979 4.86188 21.4295 4.86188 21.841V23.2045H5.45367V23.2045ZM13.4542 20.7349H12.5796V19.9889H12.0394V20.7349H11.5506V21.2236H12.0393V22.3556C12.0393 22.9216 12.2708 23.256 12.8883 23.256C13.1198 23.256 13.377 23.1788 13.5572 23.076L13.4027 22.6128C13.2484 22.7157 13.0684 22.7415 12.9397 22.7415C12.6825 22.7415 12.5796 22.5872 12.5796 22.3298V21.2236H13.4542V20.7349V20.7349ZM18.0334 20.6833C17.7247 20.6833 17.5189 20.8378 17.3903 21.0436V20.7349H16.85V23.2045H17.3903V21.8154C17.3903 21.4038 17.5703 21.1722 17.9047 21.1722C18.0076 21.1722 18.1363 21.198 18.2392 21.2237L18.3935 20.7092C18.2906 20.6835 18.1363 20.6835 18.0334 20.6835V20.6833ZM11.1132 20.9407C10.8559 20.7606 10.4958 20.6835 10.1099 20.6835C9.49254 20.6835 9.08098 20.9921 9.08098 21.4809C9.08098 21.8926 9.38965 22.124 9.92988 22.2013L10.1871 22.2271C10.4701 22.2784 10.6245 22.3556 10.6245 22.4843C10.6245 22.6643 10.4187 22.7929 10.0584 22.7929C9.69832 22.7929 9.41531 22.6643 9.23519 22.5357L8.97797 22.9473C9.26098 23.1531 9.64688 23.256 10.0327 23.256C10.753 23.256 11.1647 22.9216 11.1647 22.4585C11.1647 22.0212 10.8302 21.7896 10.3157 21.7125L10.0584 21.6867C9.82688 21.6609 9.64687 21.6096 9.64687 21.4553C9.64687 21.2751 9.82687 21.1722 10.1099 21.1722C10.4187 21.1722 10.7273 21.3008 10.8817 21.378L11.1132 20.9407V20.9407ZM25.4681 20.6835C25.1593 20.6835 24.9536 20.8378 24.8249 21.0436V20.7349H24.2846V23.2045H24.8249V21.8154C24.8249 21.4038 25.005 21.1722 25.3393 21.1722C25.4423 21.1722 25.571 21.198 25.6739 21.2237L25.8282 20.7092C25.7254 20.6835 25.571 20.6835 25.4681 20.6835V20.6835ZM18.5736 21.9697C18.5736 22.7157 19.0881 23.256 19.8857 23.256C20.2458 23.256 20.503 23.1788 20.7602 22.9731L20.503 22.5357C20.2972 22.6901 20.0914 22.7672 19.8599 22.7672C19.4225 22.7672 19.1139 22.4585 19.1139 21.9697C19.1139 21.5067 19.4225 21.1979 19.8599 21.1722C20.0914 21.1722 20.2972 21.2494 20.503 21.4038L20.7602 20.9665C20.503 20.7606 20.2458 20.6835 19.8857 20.6835C19.0881 20.6835 18.5736 21.2237 18.5736 21.9697ZM23.5644 21.9697V20.7349H23.0242V21.0436C22.8441 20.8121 22.5868 20.6835 22.2524 20.6835C21.5578 20.6835 21.0176 21.2237 21.0176 21.9697C21.0176 22.7157 21.5578 23.256 22.2524 23.256C22.6125 23.256 22.8698 23.1274 23.0242 22.8958V23.2045H23.5644V21.9697V21.9697ZM21.5835 21.9697C21.5835 21.5324 21.8665 21.1722 22.3295 21.1722C22.7668 21.1722 23.0756 21.5067 23.0756 21.9697C23.0756 22.4071 22.7668 22.7672 22.3295 22.7672C21.8665 22.7414 21.5835 22.4071 21.5835 21.9697V21.9697ZM15.1264 20.6835C14.4061 20.6835 13.8915 21.1979 13.8915 21.9697C13.8915 22.7415 14.406 23.256 15.1521 23.256C15.5122 23.256 15.8725 23.1531 16.1555 22.9216L15.8981 22.5357C15.6923 22.6901 15.4351 22.7929 15.1779 22.7929C14.8434 22.7929 14.509 22.6386 14.4318 22.2012H16.2584V21.9955C16.2841 21.1979 15.821 20.6835 15.1263 20.6835H15.1264ZM15.1264 21.1465C15.4608 21.1465 15.6925 21.3524 15.7438 21.7383H14.4575C14.509 21.4038 14.7405 21.1465 15.1264 21.1465ZM28.5294 21.9697V19.7573H27.9892V21.0436C27.8091 20.8121 27.5518 20.6835 27.2174 20.6835C26.5228 20.6835 25.9826 21.2237 25.9826 21.9697C25.9826 22.7157 26.5228 23.256 27.2174 23.256C27.5776 23.256 27.8348 23.1274 27.9892 22.8958V23.2045H28.5294V21.9697V21.9697ZM26.5486 21.9697C26.5486 21.5324 26.8315 21.1722 27.2946 21.1722C27.732 21.1722 28.0406 21.5067 28.0406 21.9697C28.0406 22.4071 27.732 22.7672 27.2946 22.7672C26.8315 22.7414 26.5486 22.4071 26.5486 21.9697V21.9697ZM8.48918 21.9697V20.7349H7.94895V21.0436C7.76883 20.8121 7.5116 20.6835 7.17715 20.6835C6.48258 20.6835 5.94234 21.2237 5.94234 21.9697C5.94234 22.7157 6.48258 23.256 7.17715 23.256C7.53738 23.256 7.79461 23.1274 7.94895 22.8958V23.2045H8.48918V21.9697V21.9697ZM6.48258 21.9697C6.48258 21.5324 6.76559 21.1722 7.22859 21.1722C7.66594 21.1722 7.97473 21.5067 7.97473 21.9697C7.97473 22.4071 7.66594 22.7672 7.22859 22.7672C6.76559 22.7414 6.48258 22.4071 6.48258 21.9697V21.9697Z" fill="black" />
              <path d="M10.9336 1.98096H19.0371V16.5416H10.9336V1.98096Z" fill="#FF5F00" />
              <path d="M11.4479 9.26121C11.4479 6.30281 12.8371 3.67875 14.9722 1.98082C13.4031 0.746016 11.4223 0 9.26133 0C4.14176 0 0 4.14176 0 9.26121C0 14.3805 4.14176 18.5224 9.26121 18.5224C11.4221 18.5224 13.403 17.7764 14.9722 16.5415C12.8371 14.8693 11.4479 12.2196 11.4479 9.26121V9.26121Z" fill="#EB001B" />
              <path d="M29.9703 9.26121C29.9703 14.3805 25.8285 18.5224 20.7091 18.5224C18.5481 18.5224 16.5673 17.7764 14.998 16.5415C17.159 14.8437 18.5225 12.2196 18.5225 9.26121C18.5225 6.30281 17.1332 3.67875 14.998 1.98082C16.5672 0.746016 18.5481 0 20.7091 0C25.8285 0 29.9704 4.16754 29.9704 9.26121H29.9703Z" fill="#F79E1B" />
            </g>
            <defs>
              <clipPath id="clip0">
                <rect width="30" height="23.3203" fill="white" />
              </clipPath>
            </defs>
          </svg>
        </div>

        <a href="https://prolum.com.ua/privacypolicy/">oferta</a>
      </footer>
    </div>
  )
}

export default Home
