import React from 'react'

const oferta = () => (
  <div>
    Ресурс предлагает физическим лицам заключить договор на условиях оферты.

    Предмет договора: продажа рационов через сайт https://foodcoachiryna.com.ua. Описание товаров, цены и способы оплаты доступны в разделе «Каталог».
    Договор считается заключенным с момента оплаты заказа покупателем.
    Доступ к товару с момента оформления заказа. 
    Товар возврату не подлежит. Отправьте нам письмо на serjukl98@gmail.com. Мы рассмотрим претензию и ответим вам в течение 3 рабочих дней.
    Покупатель согласен предоставить продавцу следующие персональные данные:
    имя - IRYNA;
    контактный номер телефона -  +380 96 241 54 85;
    адрес электронной почты - serjukl98@gmail.com;
    При оплате с помощью банковской карты, клиент направляется на платежный сервис LiqPay, который отвечает за обработку и сохранность данных банковской карты клиента.

    Данные клиента используются для оплаты заказа и осуществления доставки.

    Магазин вправе изменить оферту по своему усмотрению. Изменения вступают в силу с момента публикации на сайте https://foodcoachiryna.com.ua/.

  </div>
)

export default oferta
