import React from 'react'

const oferta = () => (
  <div>
    Ресурс предлагает физическим лицам заключить договор на условиях оферты.

    Предмет договора: продажа рационов через сайт https://foodcoachiryna.com.ua. Описание товаров, цены и способы оплаты доступны в разделе «Каталог».
    Договор считается заключенным с момента оплаты заказа покупателем.
    Доступ к товару с момента оформления заказа. 
    Товар надлежащего качества можно вернуть в течение 7 дней с момента получения при полном сохранении товарного вида. Для возврата отправьте письмо на support@myshop.ru и укажите: номер и дату заказа, контактный телефон. Если хотите вернуть бракованный товар, приложите к письму фотографию, на которой хорошо виден брак. Наш сотрудник свяжется с вами в течение 24 часов. При выполнении этих условий мы вернем деньги или заменим товар в течение 3 рабочих дней.
    При возникновении жалоб, досудебный порядок разрешения споров обязателен. Отправьте нам письмо на support@myshop.ru. Мы рассмотрим претензию и ответим вам в течение 3 рабочих дней.
    Если договориться не получится, споры передаются на рассмотрение Арбитражного суда города У.
    Покупатель согласен предоставить продавцу следующие персональные данные:
    имя - IRYNA;
    контактный номер телефона -  +380 96 241 54 85;
    адрес электронной почты - serjukl98@gmail.com;
    При оплате с помощью банковской карты, клиент направляется на платежный сервис LiqPay, который отвечает за обработку и сохранность данных банковской карты клиента.

    Данные клиента используются для оплаты заказа и осуществления доставки.

    Магазин вправе изменить оферту по своему усмотрению. Изменения вступают в силу с момента публикации на сайте https://foodcoachiryna.com.ua/.

  </div>
)

export default oferta
