import React from 'react'

const oferta = () => (
  <div>
    <h1>
      Ресурс предлагает физическим лицам заключить договор на условиях оферты.
    </h1>

    <p>
      Предмет договора: продажа рационов через сайт https://foodcoachiryna.com.ua. 
      Описание товаров, цены и способы оплаты доступны в разделе «FAQ».
      Договор считается заключенным с момента оплаты заказа покупателем.
    </p>
    <p>Доступ к товару с момента оформления заказа. </p>
    <p>
      Товар возврату не подлежит.
      Отправьте нам письмо на serjukl98@gmail.com.
      Мы рассмотрим претензию и ответим вам в течение 3 рабочих дней.
    </p>
    Покупатель согласен предоставить продавцу следующие персональные данные:
    <ul>
      <li>Раціон від IRYNA SHEREMETA;</li>
      <li>контактный номер телефона -  +380 96 241 54 85;</li>
      <li>адрес - 75002, г.Ивано-Франковск, Ивасюка 40;</li>
      <li>Оплата платіжними картами Visa та MasterCard - WayForPay</li>
      <li>адрес электронной почты - serjukl98@gmail.com;</li>
      <li>
        При оплате с помощью банковской карты, клиент направляется на платежный
        сервис WayForPay, который отвечает за обработку и сохранность данных банковской
        карты клиента.
      </li>
      <li>Данные клиента используются для оплаты заказа и осуществления доставки.</li>
      <li>
        Магазин вправе изменить оферту по своему усмотрению. 
        Изменения вступают в силу с момента публикации на сайте https://foodcoachiryna.com.ua/.
      </li>
    </ul>
  </div>
)

export default oferta
